package practice;

public class Practices7 {
  // 7-1
  // →電卓の中に入っているプログラムは、「指示した通りに素早く計算してくれる人」を機械化・自動化したものです
  // →電子メールは、現実世界の「手紙」を電子化したものであり、そのメールを送信するインターネットのメールシステムは「郵便配送の仕組み」を機械化したものです。
  // →ネットショッピングサイトは、現実世界の「商店」を電子化したものであり、そのプログラムは従来、店員が受け持っていた「商品の検索依頼・注文依頼・決済」などを自動化したものです。

  // 7-2
  // ①「飛行機」オブジェクト、「空港」オブジェクト
  // ②「映画館」オブジェクト、「映画一覧」オブジェクト
  // ③「食材」オブジェクト、「料理」オブジェクト→「レシピ」オブジェクト、「検索」オブジェクト→「料理」オブジェクト

  // 7-3
  // ①「指定条件に基づいて観光地を検索する」操作
  // ②「名所の名前」属性、「名所の所在地」属性、「名所の電話番号」属性、「名所の解説」属性
}
